In [8]:
from pyspark.sql import SparkSession

In [9]:
spark = SparkSession \
    .builder \
    .appName("spark dataframe in python") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()

In [10]:
df = spark.read.csv("Emp.csv")

In [11]:
df.show()

+--------------------+--------------------+----------------+---------+--------------------+
|                 _c0|                 _c1|             _c2|      _c3|                 _c4|
+--------------------+--------------------+----------------+---------+--------------------+
|                NAME|           JOB TITLE|      DEPARTMENT|  EMP_SAL|ESTIMATED ANNUAL SAL|
|     AARON,  ELVIA J|    WATER RATE TAKER|     WATER MGMNT|$81000.00|           $73862.00|
|   AARON,  JEFFERY M|      POLICE OFFICER|          POLICE|$74628.00|           $74628.00|
| AARON,  KIMBERLEI R|CHIEF CONTRACT EX...| FLEET MANAGEMNT|$77280.00|           $70174.00|
| ABAD JR,  VICENTE M|   CIVIL ENGINEER IV|     WATER MGMNT|$96276.00|           $96276.00|
|ABBATACOLA,  ROBE...| ELECTRICAL MECHANIC|     WATER MGMNT|$84032.00|           $76627.00|
|    ABBATE,  TERRY M|      POLICE OFFICER|          POLICE|$79926.00|           $79926.00|
|ABBATEMARCO,  JAM...|         FIREFIGHTER|            FIRE|$77238.00|           $77238.00|
|    ABBOTT,  BETTY L|  FOSTER GRANDPARENT|FAMILY & SUPPORT| $2756.00|            $2756.00|
|   ABBOTT,  LYNISE M|           CLERK III|FAMILY & SUPPORT|$38568.00|           $38568.00|
|      ABBOTT,  SAM J| ELECTRICAL MECHANIC|      TRANSPORTN|$84032.00|           $76627.00|
|ABDELHADI,  ABDAL...|      POLICE OFFICER|          POLICE|$71040.00|           $71040.00|
| ABDELLATIF,  AREF R|FIREFIGHTER (PER ...|            FIRE|$86922.00|           $86922.00|
|  ABDELMAJEID,  AZIZ|      POLICE OFFICER|          POLICE|$67704.00|           $67704.00|
| ABDOLLAHZADEH,  ALI|           PARAMEDIC|            FIRE|$64374.00|           $64374.00|
|ABDUL-KARIM,  MUH...|ENGINEERING TECHN...|     WATER MGMNT|$81000.00|           $81000.00|
|    ABDULLAH,  KEVIN|         FIREFIGHTER|            FIRE|$83148.00|           $83148.00|
|ABDULLAH,  LAKENYA N|      CROSSING GUARD|          POLICE|$15319.00|           $15319.00|
| ABDULLAH,  MOULAY R|      POLICE OFFICER|          POLICE|$82878.00|           $82878.00|
| ABDULLAH,  RASHAD J|ELECTRICAL MECHAN...| FLEET MANAGEMNT|$84032.00|           $76627.00|
+--------------------+--------------------+----------------+---------+--------------------+
only showing top 20 rows

In [29]:
df.printSchema()

root
 |-- _c0: string (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: string (nullable = true)
 |-- _c3: string (nullable = true)
 |-- _c4: string (nullable = true)

In [33]:
df.select("_C0").show()

+--------------------+
|                 _C0|
+--------------------+
|                NAME|
|     AARON,  ELVIA J|
|   AARON,  JEFFERY M|
| AARON,  KIMBERLEI R|
| ABAD JR,  VICENTE M|
|ABBATACOLA,  ROBE...|
|    ABBATE,  TERRY M|
|ABBATEMARCO,  JAM...|
|    ABBOTT,  BETTY L|
|   ABBOTT,  LYNISE M|
|      ABBOTT,  SAM J|
|ABDELHADI,  ABDAL...|
| ABDELLATIF,  AREF R|
|  ABDELMAJEID,  AZIZ|
| ABDOLLAHZADEH,  ALI|
|ABDUL-KARIM,  MUH...|
|    ABDULLAH,  KEVIN|
|ABDULLAH,  LAKENYA N|
| ABDULLAH,  MOULAY R|
| ABDULLAH,  RASHAD J|
+--------------------+
only showing top 20 rows

In [34]:
df.columns
# Returns list of column names or headers.

['_c0', '_c1', '_c2', '_c3', '_c4']

In [35]:
df.collect

In [38]:
df.cache()

DataFrame[_c0: string, _c1: string, _c2: string, _c3: string, _c4: string]

In [16]:
df.freqItems(('_c3','_c4')).take(1)

# most frequent items

[Row(_c3_freqItems=['$78354.00', '$73932.00', '$79926.00', '$60708.00', '$18886.00', '$42432.00', '$95694.00', '$70408.00', '$89773.00', '$91520.00', '$87048.00', '$88140.00', '$80916.00', '$66960.00', '$71040.00', '$81096.00', '$73216.00', '$67296.00', '$71082.00', '$92268.00', '$73752.00', '$18439.00', '$56208.00', '$86508.00', '$82638.00', '$83148.00', '$101958.00', '$58548.00', '$44280.00', '$98766.00', '$92778.00', '$110352.00', '$77772.00', '$53340.00', '$102204.00', '$77238.00', '$49992.00', '$58860.00', '$55872.00', '$16047.00', '$89646.00', '$15319.00', '$84032.00', '$74628.00', '$85278.00', '$67596.00', '$83562.00', '$83028.00', '$100048.00', '$63586.00', '$2756.00', '$82878.00', '$61308.00', '$50952.00', '$65894.00', '$64374.00', '$93933.00'], _c4_freqItems=['$78354.00', '$73932.00', '$79926.00', '$48108.00', '$18886.00', '$42432.00', '$95694.00', '$70408.00', '$56379.00', '$73848.00', '$88140.00', '$51388.00', '$66960.00', '$71040.00', '$81096.00', '$67296.00', '$71082.00', '$92268.00', '$57675.00', '$40368.00', '$55358.00', '$64805.00', '$134976.00', '$33053.00', '$18439.00', '$107064.00', '$86508.00', '$60792.00', '$83148.00', '$101958.00', '$58548.00', '$44280.00', '$57022.00', '$96276.00', '$98766.00', '$92778.00', '$79377.00', '$46428.00', '$35124.00', '$53340.00', '$70621.00', '$77238.00', '$77291.00', '$21704.00', '$49992.00', '$19313.00', '$57982.00', '$91260.00', '$73475.00', '$111096.00', '$100205.00', '$50948.00', '$85655.00', '$25152.00', '$58253.00', '$55872.00', '$76627.00', '$16047.00', '$53839.00', '$86460.00', '$89646.00', '$11471.00', '$15319.00', '$74628.00', '$87756.00', '$75356.00', '$83455.00', '$80645.00', '$64248.00', '$66764.00', '$60088.00', '$85278.00', '$67596.00', '$83562.00', '$83028.00', '$2756.00', '$82878.00', '$79320.00', '$91232.00', '$92806.00', '$61308.00', '$71469.00', '$63276.00', '$50952.00', '$81862.00', '$36056.00', '$64374.00', '$73200.00'])]

In [42]:
df.count()

# Counts the number of records in a data frame.

34219

In [50]:
df.describe().show()

+-------+-------------------+--------------------+------------+-------+--------------------+
|summary|                _c0|                 _c1|         _c2|    _c3|                 _c4|
+-------+-------------------+--------------------+------------+-------+--------------------+
|  count|              34219|               34219|       34219|  34219|               34219|
|   mean|               null|                null|        null|   null|                null|
| stddev|               null|                null|        null|   null|                null|
|    min|    AARON,  ELVIA J|A/MGR COM SVC-ELE...|ADMIN HEARNG|  $1.00|               $1.00|
|    max|ZYSKOWSKI,  DARIUSZ|ZONING PLAN EXAMINER| WATER MGMNT|EMP_SAL|ESTIMATED ANNUAL SAL|
+-------+-------------------+--------------------+------------+-------+--------------------+

In [51]:
df.explain()

== Physical Plan ==
*(1) FileScan csv [_c0#94,_c1#95,_c2#96,_c3#97,_c4#98] Batched: false, Format: CSV, Location: InMemoryFileIndex[file:/C:/Users/vinay/Desktop/spark-project/Emp.csv], PartitionFilters: [], PushedFilters: [], ReadSchema: struct<_c0:string,_c1:string,_c2:string,_c3:string,_c4:string>

In [52]:
df.explain(True)

== Parsed Logical Plan ==
Relation[_c0#94,_c1#95,_c2#96,_c3#97,_c4#98] csv

== Analyzed Logical Plan ==
_c0: string, _c1: string, _c2: string, _c3: string, _c4: string
Relation[_c0#94,_c1#95,_c2#96,_c3#97,_c4#98] csv

== Optimized Logical Plan ==
Relation[_c0#94,_c1#95,_c2#96,_c3#97,_c4#98] csv

== Physical Plan ==
*(1) FileScan csv [_c0#94,_c1#95,_c2#96,_c3#97,_c4#98] Batched: false, Format: CSV, Location: InMemoryFileIndex[file:/C:/Users/vinay/Desktop/spark-project/Emp.csv], PartitionFilters: [], PushedFilters: [], ReadSchema: struct<_c0:string,_c1:string,_c2:string,_c3:string,_c4:string>

In [55]:
df.select('_c0').distinct().count()

# Returns a new dataframe with unique values from a dataframe.

33909

In [17]:
 df.drop('_c2').take(5)
    
# Drops a column from the existing data frame and returns a new data frame without the column.

[Row(_c0='NAME', _c1='JOB TITLE', _c3='EMP_SAL', _c4='ESTIMATED ANNUAL SAL'),
 Row(_c0='AARON,  ELVIA J', _c1='WATER RATE TAKER', _c3='$81000.00', _c4='$73862.00'),
 Row(_c0='AARON,  JEFFERY M', _c1='POLICE OFFICER', _c3='$74628.00', _c4='$74628.00'),
 Row(_c0='AARON,  KIMBERLEI R', _c1='CHIEF CONTRACT EXPEDITER', _c3='$77280.00', _c4='$70174.00'),
 Row(_c0='ABAD JR,  VICENTE M', _c1='CIVIL ENGINEER IV', _c3='$96276.00', _c4='$96276.00')]

In [61]:
df.select('_c0').dropDuplicates().count()

# Returns a new DataFrame with duplicate rows removed.

33909

In [62]:
df.dropna().count()

# Returns a new DataFrame omitting rows with null values.

34219

In [64]:
df.dtypes

#Returns all column names and their data types as a list.

[('_c0', 'string'),
 ('_c1', 'string'),
 ('_c2', 'string'),
 ('_c3', 'string'),
 ('_c4', 'string')]

In [73]:
df.groupBy().avg().collect()

#Groups the DataFrame using the specified columns, 
#so we can run aggregation like max, min, mean etc. on them.

[Row()]

In [75]:
df.limit(5).collect()

#Similar to limit operation in SQL, 
#This operation returns the specified
#No of records from the data frame.

[Row(_c0='NAME', _c1='JOB TITLE', _c2='DEPARTMENT', _c3='EMP_SAL', _c4='ESTIMATED ANNUAL SAL'),
 Row(_c0='AARON,  ELVIA J', _c1='WATER RATE TAKER', _c2='WATER MGMNT', _c3='$81000.00', _c4='$73862.00'),
 Row(_c0='AARON,  JEFFERY M', _c1='POLICE OFFICER', _c2='POLICE', _c3='$74628.00', _c4='$74628.00'),
 Row(_c0='AARON,  KIMBERLEI R', _c1='CHIEF CONTRACT EXPEDITER', _c2='FLEET MANAGEMNT', _c3='$77280.00', _c4='$70174.00'),
 Row(_c0='ABAD JR,  VICENTE M', _c1='CIVIL ENGINEER IV', _c2='WATER MGMNT', _c3='$96276.00', _c4='$96276.00')]

In [18]:
df.sort('_c0',ascending = False).take(5)

#Sorts the dataframe as per the order specified on a particular column.

[Row(_c0='ZYSKOWSKI,  DARIUSZ', _c1='CHIEF DATA BASE ANALYST', _c2='DoIT', _c3='$110352.00', _c4='$100205.00'),
 Row(_c0='ZYSKO,  RICHARD', _c1='LIEUTENANT', _c2='FIRE', _c3='$101958.00', _c4='$101958.00'),
 Row(_c0='ZYRKOWSKI,  CARLO E', _c1='POLICE OFFICER', _c2='POLICE', _c3='$77238.00', _c4='$77238.00'),
 Row(_c0='ZYNIEWICZ,  ROBERT J', _c1='CONSTRUCTION LABORER', _c2='WATER MGMNT', _c3='$73216.00', _c4='$66764.00'),
 Row(_c0='ZYMANTAS,  MARK E', _c1='POLICE OFFICER', _c2='POLICE', _c3='$74628.00', _c4='$74628.00')]

In [19]:
df.orderBy(df._c3.desc()).take(5)

[Row(_c0='NAME', _c1='JOB TITLE', _c2='DEPARTMENT', _c3='EMP_SAL', _c4='ESTIMATED ANNUAL SAL'),
 Row(_c0='HAUSWIRTH,  KEVIN', _c1='ASST PRESS SECRETARY', _c2="MAYOR'S OFFICE", _c3='$99996.00', _c4='$90801.00'),
 Row(_c0='TAYLOR,  KIMBERLY A', _c1='DEPUTY COMMISSIONER', _c2='DISABILITIES', _c3='$99984.00', _c4='$90790.00'),
 Row(_c0='HARRIS,  GWENDOLYN S', _c1='ASST CORPORATION COUNSEL SUPVSR', _c2='LAW', _c3='$99948.00', _c4='$90757.00'),
 Row(_c0='BAGDON,  BONNIE F', _c1='ASST CORPORATION COUNSEL SUPVSR', _c2='LAW', _c3='$99948.00', _c4='$90757.00')]

In [80]:
df.printSchema()

root
 |-- _c0: string (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: string (nullable = true)
 |-- _c3: string (nullable = true)
 |-- _c4: string (nullable = true)

In [87]:
df.schema

StructType(List(StructField(_c0,StringType,true),StructField(_c1,StringType,true),StructField(_c2,StringType,true),StructField(_c3,StringType,true),StructField(_c4,StringType,true)))

In [20]:
df.select('*').take(5)

[Row(_c0='NAME', _c1='JOB TITLE', _c2='DEPARTMENT', _c3='EMP_SAL', _c4='ESTIMATED ANNUAL SAL'),
 Row(_c0='AARON,  ELVIA J', _c1='WATER RATE TAKER', _c2='WATER MGMNT', _c3='$81000.00', _c4='$73862.00'),
 Row(_c0='AARON,  JEFFERY M', _c1='POLICE OFFICER', _c2='POLICE', _c3='$74628.00', _c4='$74628.00'),
 Row(_c0='AARON,  KIMBERLEI R', _c1='CHIEF CONTRACT EXPEDITER', _c2='FLEET MANAGEMNT', _c3='$77280.00', _c4='$70174.00'),
 Row(_c0='ABAD JR,  VICENTE M', _c1='CIVIL ENGINEER IV', _c2='WATER MGMNT', _c3='$96276.00', _c4='$96276.00')]

In [90]:
df.describe().show()

+-------+-------------------+--------------------+------------+-------+--------------------+
|summary|                _c0|                 _c1|         _c2|    _c3|                 _c4|
+-------+-------------------+--------------------+------------+-------+--------------------+
|  count|              34219|               34219|       34219|  34219|               34219|
|   mean|               null|                null|        null|   null|                null|
| stddev|               null|                null|        null|   null|                null|
|    min|    AARON,  ELVIA J|A/MGR COM SVC-ELE...|ADMIN HEARNG|  $1.00|               $1.00|
|    max|ZYSKOWSKI,  DARIUSZ|ZONING PLAN EXAMINER| WATER MGMNT|EMP_SAL|ESTIMATED ANNUAL SAL|
+-------+-------------------+--------------------+------------+-------+--------------------+

In [91]:
df.toJSON().first()

#Converts the data frame into JSON representable string.

'{"_c0":"NAME","_c1":"JOB TITLE","_c2":"DEPARTMENT","_c3":"EMP_SAL","_c4":"ESTIMATED ANNUAL SAL"}'